app/controllers/posts_controller.rb

INSERT INTO "posts" ("name", "updated_at", "title", "content", "created_at") VALUES('avon', '2010-03-25 21:48:39', 'Avon nas redes sociais, do porta-a-porta para o Social Beauty', 'Não tenho dúvida de que a Avon é uma das marcas do mundo que mais entende de redes sociais. Começou com vendas porta-a-porta, mas logo chegou a um sistema de vendas diretas no qual as “Avon ladies” vendem produtos para suas amigas. No entanto, desde 1886 quando a empresa foi fundada, o mundo mudou muito.
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

DELETE FROM "posts" WHERE "id" = 3
---
  def destroy
    @post.destroy

SELECT * FROM "posts" WHERE ("posts"."id" = 3)
---
    def find_post
      @post = Post.find(params[:id])